// Constants and placeholders will be defined or replaced on the fly before the file is compiled.
// Variables that are surrounded by double underscores will be automatically replaced before
// the file is built.

#pragma GCC diagnostic ignored "-Wimplicit-function-declaration"

#define bool char
#define false 0
#define true 1

#define NULL ((void*)0)

#define BUTTON_DOWN 0x00000004  // D-pad Down (or X in alternative buttons)
#define BUTTON_UP 0x00000008    // D-pad Up (or Y in alternative buttons)

#define ALT_BUTTONS_STATE_ADDRESS __ALT_BUTTONS_STATE_ADDRESS__
#define BATTLE_STAGES __BATTLE_STAGES__
#define BUTTONS_STATE_ADDRESS __BUTTONS_STATE_ADDRESS__
#define COURSE_TO_STREAM_FILE_INDEX_ADDRESS __COURSE_TO_STREAM_FILE_INDEX_ADDRESS__
#define CURRENT_PAGE_ADDRESS __CURRENT_PAGE_ADDRESS__
#define EXTENDER_CUP __EXTENDER_CUP__
#define GAMEAUDIO_MAIN_ADDRESS __GAMEAUDIO_MAIN_ADDRESS__
#define GM4E01_DEBUG_BUILD __GM4E01_DEBUG_BUILD__
#define GM4P01_PAL __GM4P01_PAL__
#define GP_AWARDED_SCORES_ADDRESS __GP_AWARDED_SCORES_ADDRESS__
#define GP_COURSE_INDEX_ADDRESS __GP_COURSE_INDEX_ADDRESS__
#define GP_CUP_INDEX_ADDRESS __GP_CUP_INDEX_ADDRESS__
#define GP_GLOBAL_COURSE_INDEX_ADDRESS __GP_GLOBAL_COURSE_INDEX_ADDRESS__
#define GP_INITIAL_PAGE_ADDRESS __GP_INITIAL_PAGE_ADDRESS__
#define LAN_STRUCT_ADDRESS __LAN_STRUCT_ADDRESS__
#define LAN_STRUCT_OFFSET1 __LAN_STRUCT_OFFSET1__
#define LAN_STRUCT_OFFSET2 __LAN_STRUCT_OFFSET2__
#define LAN_STRUCT_OFFSET3 __LAN_STRUCT_OFFSET3__

    g_scenemapselect = this;

    SceneMapSelect__calcAnm();
    process_course_page_change(BATTLE_MODE);
}
#endif

void lanselectmode_calcanm_ex()
{
    LANSelectMode__calcAnm();
    process_course_page_change(LAN_MODE);
}

#endif

#if EXTENDER_CUP

#define MUSHROOM_CUP_INDEX 0
#define FLOWER_CUP_INDEX 1
#define STAR_CUP_INDEX 2
#define SPECIAL_CUP_INDEX 3
#define ALL_CUP_TOUR_INDEX 4

// Data that will be used in SceneCourseSelect::setTexture(), that expects a pointer to the array
// holding the four filenames of the images that will be shown vertically in the All-Cup Tour, and
// which will be replaced with different images.
const char* const g_extender_cup_cup_filenames[4] = {
    "CupName_MUSHROOM_CUP.bti",
    "CupName_FLOWER_CUP.bti",
    "CupName_STAR_CUP.bti",
    "CupName_SPECIAL_CUP.bti",
};

// Filename of the preview image to be shown for the Extender Cup.
const char g_extender_cup_preview_filenames[] = "extender_cup_preview.bti";

#if PAGE_COUNT > 6
const int g_original_awarded_scores[8] = {10, 8, 6, 4, 3, 2, 1, 0};
#if PAGE_COUNT == 7
const int g_limited_awarded_scores[8] = {8, 6, 5, 4, 3, 2, 1, 0};
#elif PAGE_COUNT == 8
const int g_limited_awarded_scores[8] = {7, 6, 5, 4, 3, 2, 1, 0};
#elif PAGE_COUNT == 9
const int g_limited_awarded_scores[8] = {6, 5, 4, 3, 2, 1, 0, 0};
#elif PAGE_COUNT == 10
const int g_limited_awarded_scores[8] = {6, 5, 4, 3, 2, 1, 0, 0};
#endif
#endif

void on_gp_about_to_start()
{
    asm("stw 0, 0x0094(3)");  // Hijacked instruction.

    *(char*)GP_GLOBAL_COURSE_INDEX_ADDRESS = 0;
    *(char*)GP_INITIAL_PAGE_ADDRESS = *(const char*)CURRENT_PAGE_ADDRESS;

#if PAGE_COUNT > 6
    const int* const awarded_scores = (*(const char*)GP_CUP_INDEX_ADDRESS != ALL_CUP_TOUR_INDEX)
                                          ? g_original_awarded_scores
                                          : g_limited_awarded_scores;
    for (int i = 0; i < 8; ++i)
    {
        ((int*)GP_AWARDED_SCORES_ADDRESS)[i] = awarded_scores[i];
    }
#endif
}

int get_gp_course_index()
{
    if (*(const char*)GP_CUP_INDEX_ADDRESS != ALL_CUP_TOUR_INDEX)
    {
        // To match the hijacked instruction, which stores the course index in r3.
        return *(char*)GP_COURSE_INDEX_ADDRESS;
    }

    return *(char*)GP_GLOBAL_COURSE_INDEX_ADDRESS;
}

void sequenceinfo_setclrgpcourse_ex()
{
    SequenceInfo__setClrGPCourse();

    if (*(const char*)GP_CUP_INDEX_ADDRESS != ALL_CUP_TOUR_INDEX)
        return;

    const char global_course_index = ++*(char*)GP_GLOBAL_COURSE_INDEX_ADDRESS;
    char* const course_index = (char*)GP_COURSE_INDEX_ADDRESS;

    if (*course_index == 16)
    {
        if (global_course_index < PAGE_COUNT * 16)
        {
            *course_index = 0;
        }

        const char initial_page = *(const char*)GP_INITIAL_PAGE_ADDRESS;
        const char pages_played = global_course_index / 16;
        *(char*)CURRENT_PAGE_ADDRESS = initial_page + pages_played - 1;
    }

    change_course_page(1);
}

#endif

#if TYPE_SPECIFIC_ITEM_BOXES

struct GeoObject
{
    char field_0[232];
    struct SObject* sobj;
};

struct SObject
{
    int xpos;
    int ypos;
    int zpos;
    int xscale;
    int yscale;
    int zscale;
    short forwardx;
    short forwardy;
    short forwardz;
    short upx;
    short upy;
    short upz;
    short objectid;
    short link;
    short field_28;
    short targetpoint;
    char proclevel_filter;
    char proclevel;
    char collisionflag;
    char field_2F;
    short s16fixedpoint1;
    short s16fixedpoint2;
    short field_34;
    short field_36;
    short s16fixedpoint3;
    short s16fixedpoint4;
    short field_3C;
    short idk_availability;
};

int itemobjmgr_isavailablerollingslot_ex(const unsigned int* const itemobjmgr,
                                         const int player,
                                         const unsigned int val2)
{
#if GM4E01_DEBUG_BUILD
    register const struct GeoObject* const itembox asm("r28");
#else
    register const struct GeoObject* const itembox asm("r29");
#endif

    const int is_available = ItemObjMgr__IsAvailableRollingSlot(itemobjmgr, player, val2);
    if (is_available)
    {
        const struct SObject* const sobj = itembox->sobj;
        signed char* const player_item_rolls = (signed char*)PLAYER_ITEM_ROLLS_ADDRESS;
        player_item_rolls[player] = (signed char)(sobj->field_36 == 0 ? -1 : sobj->field_36 - 1);
    }

    return is_available;
}

int itemshufflemgr_calcslot_ex(const unsigned int* const itemshufflemgr,
                               const unsigned int* const kartrankdataset,
                               const int unk1,
                               const int unk2,
                               const bool unk3)
{
    const int player = *(kartrankdataset - 8 / 4);
    const signed char* const player_item_rolls = (const signed char*)PLAYER_ITEM_ROLLS_ADDRESS;
    const int player_item_type = (int)player_item_rolls[player];

    if (player_item_type == -1)
    {
        return ItemShuffleMgr__calcSlot(itemshufflemgr, kartrankdataset, unk1, unk2, unk3);
    }

    if (player_item_type == 20)
    {
        const int other_data = *(kartrankdataset - 1);
        const char character = (char)(other_data >> 24);
        return ItemObj__getSpecialKind(&player, &character);
    }

    return player_item_type;
}

#endif

#if SECTIONED_COURSES

static unsigned short g_section_count = 0;

// Due to the nature of the compiler, portions of the code had to be rewritten in ASM
// so that the compiler would not ignore it, and thus break this code patch.
// To compensate, nearly every set of ASM instructions has a description of what it's doing.

// Reset the section counter.
void reset_section_count()
{
    asm("or %r31, %r3, %r3");  // Run hijacked instruction.
    g_section_count = 0;
}

// During course load, count each section point.
// This will be used to jury-rig the "max laps" count to always be the section number.
void count_section_point()
{
#if GM4E01_DEBUG_BUILD
    asm("stw %r30, 0x8(%r31)");  // Run hijacked instruction.

    register const unsigned int base asm("r30");
#else
    asm("stw %r4, 0x8(%r31)");  // Run hijacked instruction.

    register const unsigned int base asm("r4");
#endif

    const bool shortcut_point = *(const bool*)(base + 0x0018);
    if (shortcut_point)
        return;

    const bool lap_checkpoint = *(const bool*)(base + 0x001B);
    if (!lap_checkpoint)
        return;

    ++g_section_count;
}

// Override the lap count in a section course to be the number of section points.
void override_total_lap_count()
{
#if GM4E01_DEBUG_BUILD
    asm("or %r22, %r3, %r3");  // Run hijacked instruction.
#else
    asm("or %r0, %r3, %r3");  // Run hijacked instruction.
#endif

    register unsigned short reg9 asm("r9") = g_section_count;

    if (reg9 != 0)
    {
        // The game will crash on a race finish if more than 9 laps/sections are present.
        if (reg9 > 9)
        {
            asm("li %r9, 0x09");
        }
        asm("sth %r9, 0x2e(%r31)");
    }
}

#if GM4E01_DEBUG_BUILD

// In the retail builds, these symbols have been inlined. In the debug build the symbols are
// defined and available in the symbols map, so they can be referenced. Only the function
// declaration is needed.
bool KartChecker__isGoal(char*);
void KartChecker__incLap(char*);

#else

// Vanilla function for incrementing a kart's current lap.
void KartChecker__incLap(char* const this)
{
    if (*(const int*)(this + 0x2c) >= *(const int*)(this + 0xc))
        return;
    *(int*)(this + 0x2c) += 1;
}

// Vanilla function for checking if the player has finished.
bool KartChecker__isGoal(char* const this)
{
    return this[0x29];
}

#endif

// Retail ASM of `KartChecker::setGoal` and `KartChecker::setGoalTime`
// Sourced from `KartChecker::checkLap`
void start_goal_routine()
{
#if GM4E01_DEBUG_BUILD
    asm(R"(
        li     %r3, 0x00
        li     %r0, 0x01
        stb    %r3, 0x78(%r30)
        stb    %r0, 0x29(%r30)
        lwz    %r3, 0x0c(%r30)
        lwz    %r4, 0x18(%r30)
        subi   %r0, %r3, 0x01
        rlwinm %r0, %r0, 0x02, 0x00, 0x1d
        lwzx   %r0, %r4, %r0
        stw    %r0, 0x84(%r30)
        lwz    %r0, 0x7c(%r30)
        stw    %r0, 0x80(%r30)
    )");
#else
    asm(R"(
        li     %r3, 0x00
        li     %r0, 0x01
        stb    %r3, 0x78(%r29)
        stb    %r0, 0x29(%r29)
        lwz    %r3, 0x0c(%r29)
        lwz    %r4, 0x18(%r29)
        subi   %r0, %r3, 0x01
        rlwinm %r0, %r0, 0x02, 0x00, 0x1d
        lwzx   %r0, %r4, %r0
        stw    %r0, 0x84(%r29)
        lwz    %r0, 0x7c(%r29)
        stw    %r0, 0x80(%r29)
    )");
#endif
}

// Lap-forcing routine.
void force_lap_increment()
{
#if GM4E01_DEBUG_BUILD
    register char* const kartcheck asm("r30");
#else
    register char* const kartcheck asm("r29");
#endif

    const int lap_count = *(const int*)(kartcheck + 0x2c);

    if (lap_count < 0)
    {
        KartChecker__incLap(kartcheck);
    }

    if (KartChecker__isGoal(kartcheck) == 0)
    {
        KartChecker__setLapTime(kartcheck);
    }

    kartcheck[0x28] = 1;

    KartChecker__incLap(kartcheck);

    if (KartChecker__isGoal(kartcheck) == 0)
    {
        const int lap_count = *(const int*)(kartcheck + 0x2c);
        const int total_lap_count = *(const int*)(kartcheck + 0xc);

        if (lap_count >= total_lap_count)
        {
            // setGoal and setGoalTime
            start_goal_routine();
        }
    }
}

// Force a lap increment when hitting a lap checkpoint.
void check_lap_ex()
{
    register char reg0 asm("r0");
    register char reg9 asm("r9");

    // setPass will have already run by this point.
    asm("rlwinm %r9, %r3, 0x0, 0x18, 0x1f");  // r9 = (char)r3

    // Compiler skipped the addressing, so let's do it via ASM.
#if GM4E01_DEBUG_BUILD
    asm("lwz %r3, 0x0044(%r30)");
#else
    asm("lwz %r3, 0x0044(%r29)");
#endif
    asm(R"(
        lwz    %r3, 0x0008 (%r3)          # r3 = *(r3 + 8) (Checkpoint 1).
        lbz    %r3, 0x001B (%r3)          # r3 = *(r3 + 0x1B) ("Lap Checkpoint" flag).
        subic  %r0, %r3, 0x01
        subfe  %r3, %r0, %r3
        rlwinm %r0, %r3, 0x0, 0x18, 0x1f  # Cast to byte.
    )");

    const bool passed = (bool)reg9;
    const bool is_section = (reg0 != '\0');  // Is the "section point" bit set?

    if (passed && is_section)
    {
        force_lap_increment();
    }

#if GM4E01_DEBUG_BUILD
    asm("lwz %r3, 0x3c(%r30)");  // Hijacked instruction.
#else
    asm("lwz %r3, 0x3c(%r29)");  // Hijacked instruction.
#endif
}
#endif

#define EXTENDED_TERRAIN_BOUNCE_FLAG 0x1
#define EXTENDED_TERRAIN_BOUNCE_LIFTOFF_FLAG 0x2

#define EXTENDED_TERRAIN_BOUNCY 0xB0

// The importance of this remaining in its own section is that its functionality will be needed for
// any future custom terrain types added, within the Extended Terrain Types patch or otherwise.
#if BOUNCY_TERRAIN_TYPE

typedef struct CollisionTriangle
{
    int point_indexes[3];
    float unknown;
    short normal[3];
    char terrain_type;
    char terrain_type_part_two;
    char min_max_table;
    char camera_code;
    short neighbor_triangles[3];
    int splash_hash;
    // splash_hash is actually a 4-byte structure.

} CollisionTriangle;

struct CrsGround
{
    char unknown[0x20];
    struct CollisionTriangle* col_triangle;
};

// Check against all of the custom material flags enabled by the patch.
bool is_extended_terrain_type(const char terrain_type)
{
    return terrain_type == EXTENDED_TERRAIN_BOUNCY;
}

bool should_return_fake_code(const struct CollisionTriangle* const triangle)
{
    return triangle && is_extended_terrain_type(triangle->terrain_type);
}

// Game will search for a Splash object due to the material hash being used.
// This nullifies that behaviour.
struct CollisionTriangle* get_splash_code_inline(const struct CrsGround* const ground)
{
    if (should_return_fake_code(ground->col_triangle))
    {
        return NULL;
    }

    return ground->col_triangle;
}

// Game does not want material flags it does not recognize to allow for items to collide with them.
// This allows items to sit on custom materials as one would ordinarily expect.
void is_item_inval_ground_hijack(const struct CrsGround* const ground)
{
    if (!should_return_fake_code(ground->col_triangle))
    {
        CrsGround__isItemInvalGround(ground);  // Original instruction.
    }
    else
    {
        asm("li %r3, 0x0");
        asm("li %r4, 0x0");
    }
}

// Unsure of the vanilla functionality of what is being hooked.
void get_add_thickness_inline()
{
    register const CollisionTriangle* const triangle asm("r25");
    if (is_extended_terrain_type(triangle->terrain_type))
    {
        asm("li %r0, 0x0");
    }
    else
    {
        asm("lbz %r0,0x20(%r25)");  // Original instruction.
    }
}

// Stop game from performing fall animation when overtop custom material.
int get_stagger_code_hijack(const struct CrsGround* const ground)
{
    if (!should_return_fake_code(ground->col_triangle))
    {
        return CrsGround__getStaggerCode(ground);  // Original instruction.
    }
    return 0;
}

#endif

#define CONTROL_STICK_RIGHT 0x1
#define CONTROL_STICK_LEFT 0x2
#define CONTROL_STICK_DOWN 0x4
#define CONTROL_STICK_UP 0x8

#define MINI_TURBO_BOOST_FLAG 0x200
#define MINI_TURBO_DRIFT_RIGHT_FLAG 0x10000
#define MINI_TURBO_DRIFT_LEFT_FLAG 0x8000
#define MINI_TURBO_CLEAR_HASH_1 0xfffffdff
#define MINI_TURBO_CLEAR_HASH_2 0xfffffffb
#define MINI_TURBO_CLEAR_HASH_3 0xfffffbff

#define GENERIC_DASH_BOOST_FLAG 0x8000
#define GENERIC_DASH_GO_BOOST_FLAG 0x10000
#define GENERIC_DASH_CLEAR_HASH 0xdffc3fff

#define BOUNCE_DESCENT_CAP -300.0f
#define BOUNCE_BOOST_XZ_FLOOR 0x4500

#if !GM4P01_PAL

#define RACE_MANAGER_OFFSET -0x5C38

#else

#define RACE_MANAGER_OFFSET -0x5C18

#endif

#define RACE_MANAGER_POINTER_OFFSET 0x38
#define RACE_MANAGER_IS_MIRROR_OFFSET 0x2C

#if BOUNCY_TERRAIN_TYPE

typedef struct RaceInfo
{
    char unknown_buffer[0x2C];
    bool is_mirror;
} RaceInfo;

typedef struct RaceMgr
{
    char unknown_buffer[0x38];
    struct RaceInfo* race_info;
} RaceMgr;

typedef struct RaceMgrContainer
{
    struct RaceMgr* race_manager;
} RaceMgrContainer;

typedef struct KartBody
{
    char unknown_buffer_col_triangle[0x4C];
    struct CollisionTriangle* col_triangle;  // Offset = 0x4C
    char unknown_buffer_curr_terrain_type[0x28];
    int curr_terrain_type;  // Offset = 0x78
    char unknown_buffer_kart_rescue[0x38];
    struct KartRescue* kart_rescue;  // Offset = 0xB4
    char unknown_buffer_kart_dossin[0x4];
    struct KartDossin* kart_dossin;  // Offset = 0xBC
    char unknown_buffer_kart_damage[0xC];
    struct KartDamage* kart_damage;  // Offset = 0xCC
    char unknown_buffer_kart_thunder[0x8];
    struct KartThunder* kart_thunder;  // Offset = 0xD8
    char unknown_buffer_kart_game[0x14];
    struct KartGame* kart_game;  // Offset 0xF0
    struct KartItem* kart_item;  // Offset 0xF4
    char unknown_buffer_position_vector[0x144];
    float position_vector[3];  // Offset = 0x23C
    char unknown_buffer_mov_vector[0x18];
    float mov_vector[3];  // Offset = 0x260
    char unknown_buffer_velocity[0x180];
    float velocity;  // Offset = 0x3EC
    char unknown_buffer_mov_scale[0x80];
    float mov_scale;  // Offset = 0x470
    char unknown_buffer_kart_state_flags_1_mt_damage[0xFC];
    unsigned int kart_state_flags_1_mt_damage;  // Offset = 0x570
    unsigned int kart_state_flags_2_dash;       // Offset = 0x574
    unsigned int kart_state_flags_3_isCPU;      // Offset = 0x578
    char unknown_buffer_crash_status[0x8];
    unsigned int crash_status;  // Offset = 0x584
    char unknown_buffer_kart_state_flags_2_timer[0xE];
    short kart_state_flags_2_timer;  // Offset = 0x596
    char unknown_buffer_kart_state_flags_1_timer[0x6];
    short kart_state_flags_1_timer;  // Offset = 0x59E
    char unknown_buffer_num_wheels_grounded[0x4];
    int num_wheels_grounded;  // Offset = 0x5A4
    char unknown_buffer_kart_num[0xB];
    char kart_num;  // Offset = 0x5B3
    char unknown_buffer_timer;
    char unknown_timer;  // Offset = 0x5B5
} KartBody;

typedef struct KartStrat
{
    struct KartBody* kart_body;
    char unknown_buffer_1[0x228];
    int kart_num;

} KartStrat;

typedef struct KartPad
{
    char dont_need_buffer[0x24];
    char stick;  // Offset 0x24
    char unknown;
    char face_buttons;      // Offset 0x26
    char shoulder_buttons;  // Offset 0x27

} KartPad;

typedef struct KartCtrl
{
    char unknown_buffer_1[0x60];
    struct KartPad* pads[8];  // Offset = 0x60
    char unknown_buffer_2[0x20];
    struct KartBody* kart_bodies[8];  // Offset = 0xA0
    char unknown_buffer_3[0xE0];
    struct KartSound* kart_sounds[8];  // Offset = 0x1A0
} KartCtrl;

float s_last_momenta[] = {0.0f, 0.0f, 0.0f, 0.0f, 0.0f, 0.0f, 0.0f, 0.0f};

// Reads number of wheels on ground. If > 0, is grounded.
bool is_touching_ground(const struct KartBody* const kart_body)
{
    return kart_body->num_wheels_grounded != 0;
}

// Is grounded and is touching bounce material flag.
bool is_touching_ground_and_bouncy_type(const struct KartBody* const kart_body)
{
    return is_touching_ground(kart_body) && kart_body->curr_terrain_type == EXTENDED_TERRAIN_BOUNCY;
}

// Moves Kart position directly. Bad when done in large amounts, which is why XZ movement is small.
void add_absolute_position_vector(struct KartBody* const kart_body,
                                  const float movement_vector_x,
                                  const float movement_vector_y,
                                  const float movement_vector_z)
{
    kart_body->position_vector[0] += movement_vector_x;
